# Database Admin 101 - Lab

## Introduction 

In this lab, you'll go through the process of designing and creating a database. From there, you'll begin to populate this table with mock data provided to you.

## Objectives

You will be able to:

* Use knowledge of the structure of databases to create a database and populate it

## The Scenario

You are looking to design a database for a school that will house various information from student grades to contact information, class roster lists and attendance. First, think of how you would design such a database. What tables would you include? What columns would each table have? What would be the primary means to join said tables?

## Creating the Database

Now that you've put a little thought into how you might design your database, it's time to go ahead and create it! Start by import the necessary packages. Then, create a database called **school.sqlite**.

In [3]:
# Import necessary packages
import sqlite3
import pandas as pd

In [4]:
# Create the database school.sqlite 
conn= sqlite3.connect("school.sqlite")
cur=conn.cursor()

## Create a Table for Contact Information

Create a table called contactInfo to house contact information for both students and staff. Be sure to include columns for first name, last name, role (student/staff), telephone number, street, city, state, and zipcode. Be sure to also create a primary key for the table.

1. Tables and Relationships
1. Students
Columns:
student_id (Primary Key)
first_name
last_name
date_of_birth
grade_level
enrollment_date
2. Staff
Columns:
staff_id (Primary Key)
first_name
last_name
date_of_birth
hire_date
role (e.g., Teacher, Administrator)
3. Classes
Columns:
class_id (Primary Key)
class_name
teacher_id (Foreign Key to staff.staff_id)
grade_level
4. Enrollment
Columns:
enrollment_id (Primary Key)
student_id (Foreign Key to students.student_id)
class_id (Foreign Key to classes.class_id)
5. Grades
Columns:
grade_id (Primary Key)
student_id (Foreign Key to students.student_id)
class_id (Foreign Key to classes.class_id)
grade
6. Attendance
Columns:
attendance_id (Primary Key)
student_id (Foreign Key to students.student_id)
class_id (Foreign Key to classes.class_id)
date
status (Present, Absent, Late)
7. ContactInfo
Columns:
contact_id (Primary Key)
first_name
last_name
role (student/staff)
telephone_number
street
city
state
zipcode
Joining the Tables
The students and staff tables will link to the contactInfo table using first_name, last_name, and role to identify individuals and manage contact information.
Students are linked to their classes via the enrollment table.
Classes are assigned teachers via a foreign key relationship between the classes and staff tables.
Grades and attendance records are associated with students and classes through their respective foreign key relationships.#

In [9]:
pd.read_sql("""
            DROP TABLE  IF EXISTS contactInfo
                  """,conn)

TypeError: 'NoneType' object is not iterable

In [10]:
pd.read_sql("""SELECT name 
            FROM sqlite_master 
            WHERE type = 'table';
            """, conn)

Empty DataFrame
Columns: [name]
Index: []

In [11]:
cur = conn.cursor()
cur.execute("""CREATE TABLE contactInfo (
                                        userId INTEGER PRIMARY KEY,
                                        firstName TEXT,
                                        lastName TEXT,
                                        role TEXT,
                                        telephone INTEGER,
                                        street TEXT,
                                        city TEXT,
                                        state TEXT,
                                        zipcode TEXT
                                        );
            """)

In [12]:
pd.read_sql(""" SELECT *
            FROM contactInfo
            """, conn)

Empty DataFrame
Columns: [userId, firstName, lastName, role, telephone, street, city, state, zipcode]
Index: []

In [10]:
cur.execute(""" 
            SELECT*
            FROM contactInfo;
            """).fetchall()

[]

## Populate the Table

Below, code is provided for you in order to load a list of dictionaries. Briefly examine the list. Each dictionary in the list will serve as an entry for your contact info table. Once you've briefly investigated the structure of this data, write a for loop to iterate through the list and create an entry in your table for each person's contact info.

In [14]:
# Load the list of dictionaries; just run this cell
import pickle

with open('contact_list.pickle', 'rb') as f:
    contacts = pickle.load(f)

In [15]:
# Check the first few entries in the contacts list
print(contacts[:3])  # Print the first 3 contacts to investigate the structure

[{'firstName': 'Christine', 'lastName': 'Holden', 'role': 'staff', 'telephone ': 2035687697, 'street': '1672 Whitman Court', 'city': 'Stamford', 'state': 'CT', 'zipcode ': '06995'}, {'firstName': 'Christopher', 'lastName': 'Warren', 'role': 'student', 'telephone ': 2175150957, 'street': '1935 University Hill Road', 'city': 'Champaign', 'state': 'IL', 'zipcode ': '61938'}, {'firstName': 'Linda', 'lastName': 'Jacobson', 'role': 'staff', 'telephone ': 4049446441, 'street': '479 Musgrave Street', 'city': 'Atlanta', 'state': 'GA', 'zipcode ': '30303'}]

In [16]:
# Assuming we have a database connection 'conn' and a cursor 'cur'
for contact in contacts:
    # Extract each field from the contact dictionary
    firstName = contact['firstName']
    lastName = contact['lastName']
    role = contact['role']
    telephone  = contact['telephone ']
    street = contact['street']
    city = contact['city']
    state = contact['state']
    zipcode  = contact['zipcode ']
    cur.execute("""INSERT INTO contactInfo (firstName, lastName, role, telephone, street, city, state, zipcode) 
                  VALUES ('{}', '{}', '{}', '{}', '{}', '{}', '{}', '{}');
                """.format(firstName, lastName, role, telephone, street, city, state, zipcode) )

**Query the Table to Ensure it is populated**

In [18]:
# Execute the INSERT statement to populate the contactInfo table
cur.execute("""
SELECT*
            FROM contactInfo
            """,)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

,userId,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,06995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,5,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
5,6,Jane,Evans,student,3259909290,1461 Briarhill Lane,Abilene,TX,79602
6,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
7,8,Ed,Lyman,student,5179695576,3478 Be Sreet,Lansing,MI,48933

## Commit Your Changes to the Database

Persist your changes by committing them to the database.

In [20]:
conn.commit()

## Create a Table for Student Grades

Create a new table in the database called "grades". In the table, include the following fields: userId, courseId, grade.

** This problem is a bit more tricky and will require a dual key. (A nuance you have yet to see.)
Here's how to do that:

```SQL
CREATE TABLE table_name(
   column_1 INTEGER NOT NULL,
   column_2 INTEGER NOT NULL,
   ...
   PRIMARY KEY(column_1,column_2,...)
);
```

In [22]:
# Create the grades table
cur.execute("""
CREATE TABLE grades(
    userId INTEGER NOT NULL,
   courseId INTEGER NOT NULL,
   grade INTEGER,
   PRIMARY KEY(userId, courseId)
);
""")

OperationalError: table grades already exists

## Remove Duplicate Entries

An analyst just realized that there is a duplicate entry in the contactInfo table! Find and remove it.

In [23]:
# Find the duplicate entry
cur.execute("""SELECT firstName, lastName, telephone, COUNT(*) 
               FROM contactInfo
               GROUP BY firstName, lastName, telephone
               HAVING COUNT(*) > 1;""").fetchall()

[('Jane', 'Evans', 3259909290, 2)]

In [24]:
# Delete the duplicate entry
cur.execute("""DELETE FROM contactInfo 
               WHERE telephone = 3259909290;""")

In [25]:
# Check that the duplicate entry was removed
cur.execute("""SELECT firstName, lastName, telephone, COUNT(*) 
               FROM contactInfo
               GROUP BY firstName, lastName, telephone
               HAVING COUNT(*) > 1;""").fetchall()

[]

## Updating an Address

Ed Lyman just moved to `2910 Simpson Avenue York, PA 17403`. Update his address accordingly.

In [26]:
# Update Ed's address
cur.execute("""UPDATE contactInfo
               SET street = "2910 Simpson Avenue",
                   city = 'York',
                   state = 'PA',
                   zipcode = '17403'
               WHERE firstName = "Ed" AND lastName = "Lyman";""")

In [28]:
# Query the database to ensure the change was made
# Update Ed's address
cur.execute("""SELECT *
            FROM contactInfo
            """)
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

,userId,firstName,lastName,role,telephone,street,city,state,zipcode
0,1,Christine,Holden,staff,2035687697,1672 Whitman Court,Stamford,CT,06995
1,2,Christopher,Warren,student,2175150957,1935 University Hill Road,Champaign,IL,61938
2,3,Linda,Jacobson,staff,4049446441,479 Musgrave Street,Atlanta,GA,30303
3,4,Andrew,Stepp,student,7866419252,2981 Lamberts Branch Road,Hialeah,Fl,33012
4,7,Mary,Raines,student,9075772295,3975 Jerry Toth Drive,Ninilchik,AK,99639
5,8,Ed,Lyman,student,5179695576,2910 Simpson Avenue,York,PA,17403

## Commit Your Changes to the Database

Once again, persist your changes by committing them to the database.

In [31]:
conn.commit()

## Summary

While there's certainly more to do with setting up and managing this database, you got a taste for creating, populating, and maintaining databases! Feel free to continue fleshing out this exercise for more practice.